        01  RDEF05-RECORD.
            05 CHOICE1-ALT1 PIC X(4).
            05 CHOICE1-ALT2 REDEFINES CHOICE1-ALT1 PIC 9V999.
            05 CHOICE1-ALT3 REDEFINES CHOICE1-ALT1 PIC 99V99.
            05 CHOICE2-ALT1 PIC X(4).
            05 CHOICE2-ALT2 REDEFINES CHOICE2-ALT1 PIC 9V999.
            05 CHOICE2-ALT3 REDEFINES CHOICE2-ALT2 PIC 99V99.
            05 CHOICE2-ALT4 REDEFINES CHOICE2-ALT3 PIC 999V9.
